Revit 2024 API
AnalyticalNodeData.GetAnalyticalNodeData Method
 Returns AnalyticalNodeData associated with this element, if it exists.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static AnalyticalNodeData GetAnalyticalNodeData(
	Element element
)
Visual Basic
Public Shared Function GetAnalyticalNodeData ( _
	element As Element _
) As AnalyticalNodeData
Visual C++
public:
static AnalyticalNodeData^ GetAnalyticalNodeData(
	Element^ element
)
Parameters
element
Type: Autodesk.Revit.DB.Element
 The element from which we try to obtain AnalyticalNodeData.
Remarks
 If the input element doesn't have AnalyticalNodeData than it retuns null. The input element should be a ReferencePoint.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
AnalyticalNodeData Class
Autodesk.Revit.DB.Structure Namespace